app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    if params[:title]
      search_term = params[:title]
      @articles = Article.search(search_term)

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first article"], ["text", "This is my first article in blog page."], ["created_at", "2017-12-11 19:45:08.886122"], ["updated_at", "2017-12-11 19:45:08.886122"]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user

    if @article.save